app/controllers/activations_controller.rb

SELECT * FROM `users` WHERE (perishable_token = 'qQWGmYcYO-JFLY_PvxWR' and updated_at > '2010-02-11 09:35:32') LIMIT 1
---
  def new
    @user = User.find_using_perishable_token(params[:activation_code])

SELECT * FROM `users` WHERE (`users`.`id` = '5') LIMIT 1
---
  def create
    @user = User.find(params[:id])